Cris7kaka/test1/STM32F4_FOC_Control.c
/**
 * @file STM32F4_FOC_Control.c
 * @brief STM32F446 FOC电机控制算法实现
 * @details 实现电流环、速度环、IF模式、VF模式控制，支持SVPWM零序注入
 * @version 1.0
 * @date 2026-04-08
 * 
 * 硬件平台: STM32F446
 * 电机ID: 0
 */

#include "STM32F4_FOC_Control.h"
#include <string.h>
#include <math.h>

/* ==================== 全局变量 ==================== */
static FOC_Controller_t foc_controllers[1]; //!< 控制器实例数组 (仅支持motor_id=0)

/* ==================== 辅助数学函数 (替代 math.h) ==================== */

/**
 * @brief 快速绝对值
 */
static inline float Fast_Fabs(float x)
 {
    return fabsf(x);
}

/**
 * @brief 快速最小值
 */
static inline float Fast_Fmin(float a, float b) 
{
    return fminf(a, b);
}

/**
 * @brief 快速最大值
 */
static inline float Fast_Fmax(float a, float b) {
    return fmaxf(a, b);
}

/**
 * @brief 快速平方根 (使用标准库函数)
 */
static float Fast_Sqrt(float x) 
{
    if (x <= 0.0f) return 0.0f;
    return sqrtf(x);
}

/* ==================== 辅助函数实现 ==================== */

/**
 * @brief 归一化角度到[0, 2π]
 */
float Normalize_Angle(float angle) {
    // 避免使用 fmodf，通过加减 2PI 来归一化
    // 对于大多数电机控制应用，角度不会在一次迭代中偏离太远
    while (angle >= _2PI) {
        angle -= _2PI;
    }
    while (angle < 0.0f) {
        angle += _2PI;
    }
    return angle;
}

/**
 * @brief 快速正弦计算 (使用标准库函数)
 */
float Fast_Sin(float angle) 
{
    return sinf(angle);
}

/**
 * @brief 快速余弦计算 (使用标准库函数)
 */
float Fast_Cos(float angle)
 {
    return cosf(angle);
}

/**
 * @brief 同时计算正弦和余弦
 */
void Fast_SinCos(float angle, float* sin_val, float* cos_val)
 {
    // 由于需要返回两个值，这里仍然需要使用指针
    *sin_val = sinf(angle);
    *cos_val = cosf(angle);
}


/* ==================== 低通滤波器实现 ==================== */

/**
 * @brief 初始化低通滤波器
 */
void LPF_Init(LowPassFilter_t* lpf, float time_constant) {
    lpf->Tf = time_constant;
    lpf->prev_output = 0.0f;
    lpf->prev_input = 0.0f;
}

/**
 * @brief 低通滤波器计算 (一阶IIR滤波器)
 */
float LPF_Compute(LowPassFilter_t* lpf, float input, float dt) {
    if (lpf->Tf <= 0.0f || dt <= 0.0f) {
        return input;  // 无滤波
    }
    
    // 计算滤波系数
    float alpha = dt / (lpf->Tf + dt);
    
    // 滤波计算
    float output = lpf->prev_output + alpha * (input - lpf->prev_output);
    
    // 更新状态
    lpf->prev_output = output;
    lpf->prev_input = input;
    
    return output;
}

/* ==================== Clarke/Park变换实现 ==================== */

/**
 * @brief Clarke变换 (abc -> αβ)
 * @note 假设三相平衡: Ia + Ib + Ic = 0
 */
AlphaBeta_t Clarke_Transform(Phase_t abc) {
    AlphaBeta_t ab;
    
    // Clarke变换公式
    ab.alpha = abc.a;
    ab.beta = _1_SQRT3 * abc.a + _2_SQRT3 * abc.b;
    
    return ab;
}

/**
 * @brief Park变换 (αβ -> dq)
 */
DQ_t Park_Transform(AlphaBeta_t ab, float angle_el) {
    DQ_t dq;
    float sin_angle, cos_angle;
    
    Fast_SinCos(angle_el, &sin_angle, &cos_angle);
    
    // Park变换公式
    dq.d = cos_angle * ab.alpha + sin_angle * ab.beta;
    dq.q = -sin_angle * ab.alpha + cos_angle * ab.beta;
    
    return dq;
}

/**
 * @brief 逆Park变换 (dq -> αβ)
 */
AlphaBeta_t Inverse_Park_Transform(DQ_t dq, float angle_el) {
    AlphaBeta_t ab;
    float sin_angle, cos_angle;
    
    Fast_SinCos(angle_el, &sin_angle, &cos_angle);
    
    // 逆Park变换公式
    ab.alpha = cos_angle * dq.d - sin_angle * dq.q;
    ab.beta = sin_angle * dq.d + cos_angle * dq.q;
    
    return ab;
}

/* ==================== SVPWM调制实现 (带零序注入) ==================== */

/**
 * @brief SVPWM调制 (带零序注入)
 * @details 使用零序注入方法提高直流母线电压利用率
 */
void SVPWM_Modulation(FOC_Controller_t* controller, float u_alpha, float u_beta)
 {
    float ua, ub, uc;
    float u_min, u_max, u_offset;
    float voltage_limit = VOLTAGE_LIMIT;
    
    // 逆Clarke变换 (αβ -> abc)
    ua = u_alpha;
    ub = -0.5f * u_alpha + SQRT3_2 * u_beta;
    uc = -0.5f * u_alpha - SQRT3_2 * u_beta;
    
    // 零序注入: 找到最小和最大值
    u_min = Fast_Fmin(ua, Fast_Fmin(ub, uc));
    u_max = Fast_Fmax(ua, Fast_Fmax(ub, uc));
    
    // 计算零序分量 (中点钳位)
    u_offset = -(u_max + u_min) / 2.0f;
    
    // 注入零序分量
    ua += u_offset;
    ub += u_offset;
    uc += u_offset;
    
    // 限制在电压范围内
    float scale = 1.0f;
    float abs_max = Fast_Fmax(Fast_Fabs(ua), Fast_Fmax(Fast_Fabs(ub), Fast_Fabs(uc)));
    if (abs_max > voltage_limit / 2.0f) {
        scale = (voltage_limit / 2.0f) / abs_max;
    }
    
    // 应用缩放并转换为PWM占空比 (0-1范围)
    controller->pwm_a = (ua * scale + voltage_limit / 2.0f) / voltage_limit;
    controller->pwm_b = (ub * scale + voltage_limit / 2.0f) / voltage_limit;
    controller->pwm_c = (uc * scale + voltage_limit / 2.0f) / voltage_limit;
    
    // 确保PWM值在[0, 1]范围内
    controller->pwm_a = Fast_Fmax(0.0f, Fast_Fmin(1.0f, controller->pwm_a));
    controller->pwm_b = Fast_Fmax(0.0f, Fast_Fmin(1.0f, controller->pwm_b));
    controller->pwm_c = Fast_Fmax(0.0f, Fast_Fmin(1.0f, controller->pwm_c));
}

/* ==================== 电流采样实现 ==================== */

// 全局ADC句柄（需要在主程序中初始化）
ADC_HandleTypeDef hadc1;
ADC_HandleTypeDef hadc2;
ADC_HandleTypeDef hadc3;

/**
 * @brief 读取三相电流
 * @note 此函数从ADC获取电流值
 */
void Read_Phase_Currents(FOC_Controller_t* controller) {
    // 静态变量用于存储偏置校准状态和偏置值
    static uint16_t calibration_count = 0;
    static float offset_a_sum = 0.0f;
    static float offset_b_sum = 0.0f;
    static float offset_c_sum = 0.0f;
    static bool calibrated = false;
    
    // 从ADC获取转换结果
    uint16_t adc_a = HAL_ADC_GetValue(&hadc1);  // A相ADC
    uint16_t adc_b = HAL_ADC_GetValue(&hadc2);  // B相ADC
    uint16_t adc_c = HAL_ADC_GetValue(&hadc3);  // C相ADC
    
    // 转换为电压值
    float voltage_a = (float)adc_a / ADC_MAX_VALUE * ADC_REF_VOLTAGE;
    float voltage_b = (float)adc_b / ADC_MAX_VALUE * ADC_REF_VOLTAGE;
    float voltage_c = (float)adc_c / ADC_MAX_VALUE * ADC_REF_VOLTAGE;
    
    if (!calibrated && calibration_count < 5000) {
        // 校准阶段：采集5000个样本计算偏置
        // 累加用于偏置计算
        offset_a_sum += voltage_a;
        offset_b_sum += voltage_b;
        offset_c_sum += voltage_c;
        
        calibration_count++;
        
        // 设置默认值直到校准完成
        controller->phase_currents.a = 0.0f;
        controller->phase_currents.b = 0.0f;
        controller->phase_currents.c = -(controller->phase_currents.a + controller->phase_currents.b);
        
        if (calibration_count >= 5000) {
            // 计算偏置值（均值）
            controller->offset_a = offset_a_sum / 5000.0f;
            controller->offset_b = offset_b_sum / 5000.0f;
            controller->offset_c = offset_c_sum / 5000.0f;
            calibrated = true;
            
