Cris7kaka/test1/STM32F4_FOC_Control.c
            // 重新初始化校准变量
            calibration_count = 0;
            offset_a_sum = 0.0f;
            offset_b_sum = 0.0f;
            offset_c_sum = 0.0f;
        }
    } else {
        // 正常运行阶段：使用偏置校准后的电流值
        // 转换为电流值 (考虑偏置和增益)
        controller->phase_currents.a = (voltage_a - controller->offset_a) / CURRENT_GAIN;
        controller->phase_currents.b = (voltage_b - controller->offset_b) / CURRENT_GAIN;
        controller->phase_currents.c = (voltage_c - controller->offset_c) / CURRENT_GAIN;
    }
}

/* ==================== 电流环FOC控制 (id=0策略) ==================== */

/**
 * @brief 电流环FOC控制 (id=0策略)
 * @details 通过电流反馈和位置反馈形成闭环控制
 */
void Current_Loop_FOC(FOC_Controller_t* controller, float iq_ref, float dt) {
    if (!controller || !controller->enabled) return;
    
    // 1. 读取三相电流（电流反馈）
    Read_Phase_Currents(controller);
    
    // 2. Clarke变换 (abc -> αβ)
    controller->alpha_beta_current = Clarke_Transform(controller->phase_currents);
    
    // 3. Park变换 (αβ -> dq)，使用位置反馈（电角度）进行坐标变换
    controller->dq_current = Park_Transform(controller->alpha_beta_current, controller->electrical_angle);
    
    // 4. 低通滤波
    controller->dq_current.d = LPF_Compute(&controller->lpf_current_d, controller->dq_current.d, dt);
    controller->dq_current.q = LPF_Compute(&controller->lpf_current_q, controller->dq_current.q, dt);
    
    // 5. 计算电流误差（电流反馈与参考值比较）
    float error_q = iq_ref - controller->dq_current.q;
    float error_d = 0.0f - controller->dq_current.d;  // 目标d轴电流通常为0 (id=0策略)
    
    // 6. PI控制器计算dq轴电压
    controller->dq_voltage.q = PI_Compute(&controller->pi_current_q, error_q, dt);
    controller->dq_voltage.d = PI_Compute(&controller->pi_current_d, error_d, dt);
    
    // 7. 限制dq轴电压幅值
    float voltage_mag = Fast_Sqrt(controller->dq_voltage.d * controller->dq_voltage.d + 
                              controller->dq_voltage.q * controller->dq_voltage.q);
    if (voltage_mag > VOLTAGE_LIMIT) {
        controller->dq_voltage.d *= (VOLTAGE_LIMIT / voltage_mag);
        controller->dq_voltage.q *= (VOLTAGE_LIMIT / voltage_mag);
    }
    
    // 8. 逆Park变换 (dq -> αβ)，使用位置反馈（电角度）进行坐标变换
    AlphaBeta_t voltage_ab = Inverse_Park_Transform(controller->dq_voltage, controller->electrical_angle);
    
    // 9. SVPWM调制 (带零序注入)
    SVPWM_Modulation(controller, voltage_ab.alpha, voltage_ab.beta);
}

/* ==================== 速度环控制 ==================== */

/**
 * @brief 速度环PI控制
 * @param controller FOC控制器实例指针
 * @param velocity_ref 目标速度 (rad/s 或 rpm，取决于单位定义)
 * @param dt 控制周期 (s)
 * @return q轴电流参考值 (A)
 */
float Velocity_Loop_Control(FOC_Controller_t* controller, float velocity_ref, float dt) {
    if (!controller || !controller->enabled) return 0.0f;
    
    // 1. 获取速度反馈并计算误差
    // 注意: shaft_velocity 需要在其他地方(如编码器中断或观测器)实时更新
    float velocity_error = velocity_ref - controller->shaft_velocity;
    
    // 2. 速度PI控制器计算q轴电流参考值
    float iq_ref = PI_Compute(&controller->pi_velocity, velocity_error, dt);
    
    // 3. 限制q轴电流输出，保护电机和驱动器
    if (iq_ref > CURRENT_LIMIT) {
        iq_ref = CURRENT_LIMIT;
    } else if (iq_ref < -CURRENT_LIMIT) {
        iq_ref = -CURRENT_LIMIT;
    }
    
    return iq_ref;
}

/* ==================== IF模式控制 (电流-频率开环) ==================== */

/**
 * @brief IF模式控制 (电流-频率开环)
 * @details 通过控制电流幅值和频率来驱动电机，仅有电流反馈闭环，位置开环
 */
void IF_Mode_Control(FOC_Controller_t* controller, float current_amplitude, float frequency, float dt) {
    if (!controller || !controller->enabled) return;
    
    // 更新开环角度和速度（基于频率的开环估计）
    float electrical_velocity = _2PI * frequency * controller->pole_pairs;
    controller->openloop_velocity = electrical_velocity / controller->pole_pairs; // 机械角速度
    controller->openloop_angle += electrical_velocity * dt;
    controller->openloop_angle = Normalize_Angle(controller->openloop_angle);
    
    // 在IF模式下，使用开环角度进行坐标变换（位置开环）
    // 电气角度由频率决定，而非来自位置传感器
    controller->electrical_angle = controller->openloop_angle;
    controller->shaft_velocity = controller->openloop_velocity;

    // 读取三相电流
    Read_Phase_Currents(controller);
    
    // Clarke变换 (abc -> αβ)
    controller->alpha_beta_current = Clarke_Transform(controller->phase_currents);
    
    // Park变换 (αβ -> dq)，使用开环电角度
    controller->dq_current = Park_Transform(controller->alpha_beta_current, controller->electrical_angle);
    
    // 低通滤波
    controller->dq_current.d = LPF_Compute(&controller->lpf_current_d, controller->dq_current.d, dt);
    controller->dq_current.q = LPF_Compute(&controller->lpf_current_q, controller->dq_current.q, dt);
    
    // 计算电流误差（IF模式下，目标d轴电流为0，q轴电流为目标幅值）
    float error_q = current_amplitude - controller->dq_current.q;
    float error_d = 0.0f - controller->dq_current.d;  // 目标d轴电流通常为0 (id=0策略)
    
    // PI控制器计算dq轴电压
    controller->dq_voltage.q = PI_Compute(&controller->pi_current_q, error_q, dt);
    controller->dq_voltage.d = PI_Compute(&controller->pi_current_d, error_d, dt);
    
    // 限制dq轴电压幅值
    float voltage_mag = Fast_Sqrt(controller->dq_voltage.d * controller->dq_voltage.d + 
                              controller->dq_voltage.q * controller->dq_voltage.q);
    if (voltage_mag > VOLTAGE_LIMIT) {
        controller->dq_voltage.d *= (VOLTAGE_LIMIT / voltage_mag);
        controller->dq_voltage.q *= (VOLTAGE_LIMIT / voltage_mag);
    }
    
    // 逆Park变换 (dq -> αβ)，使用开环电角度
    AlphaBeta_t voltage_ab = Inverse_Park_Transform(controller->dq_voltage, controller->electrical_angle);
    
    // SVPWM调制 (带零序注入)
    SVPWM_Modulation(controller, voltage_ab.alpha, voltage_ab.beta);
}

/* ==================== VF模式控制 (电压-频率开环) ==================== */

/**
 * @brief VF模式控制 (电压-频率开环)
 * @details 通过控制电压幅值和频率比值来驱动电机，保持磁通恒定
 */
void VF_Mode_Control(FOC_Controller_t* controller, float voltage_amplitude, float frequency, float dt) {
    if (!controller || !controller->enabled) return;
    
    // 更新开环角度和速度
    float electrical_velocity = _2PI * frequency * controller->pole_pairs;
    controller->openloop_velocity = electrical_velocity / controller->pole_pairs;
    controller->openloop_angle += electrical_velocity * dt;
    controller->openloop_angle = Normalize_Angle(controller->openloop_angle);
    
    // 更新电角度
    controller->electrical_angle = controller->openloop_angle;
    controller->shaft_velocity = controller->openloop_velocity;

