Cris7kaka/test1/STM32F4_FOC_Control.c
    // VF模式：基于电压幅值和频率生成dq轴电压参考
    // 对于VF模式，直接生成电压指令
    // 注意：参考方案中使用 sin/cos(openloop_angle) 分配 dq 电压，这实际上是在静止坐标系下旋转电压矢量
    // 但随后又进行了 Inverse Park Transform。如果 dq 电压已经是旋转后的值，再逆变换会导致双重旋转。
    // 标准 VF 开环通常直接设定 Vq = V_ref, Vd = 0 在旋转坐标系下，或者直接在静止坐标系下生成正弦波。
    // 参考方案代码:
    // controller->dq_voltage.q = voltage_amplitude * sinf(controller->openloop_angle);
    // controller->dq_voltage.d = voltage_amplitude * cosf(controller->openloop_angle);
    // 这里的 openloop_angle 是电气角度。如果这是 Park 变换的逆过程输入，那么 dq 应该是常量幅值。
    // 如果参考方案意在直接在 alpha-beta 或 abc 层面控制，通常不经过 Park 逆变换。
    // 但为了保持与现有 SVPWM 接口一致，我们假设需要在旋转坐标系下产生恒定电压矢量，即 Vd=0, Vq=Vamp。
    // 然而，参考方案明确写了 sin/cos。这通常用于当 angle 是静止角度时。
    // 让我们仔细看参考方案：它没有调用 Inverse Park，而是直接限制了 dq_voltage。
    // 等等，参考方案片段里并没有显示 VF 模式最后的 SVPWM 调用部分，只显示了电压计算。
    // 原代码中有 Inverse Park 和 SVPWM。
    // 如果我们要严格遵循参考方案的 "dq_voltage.q = ... sin ..." 逻辑，这暗示 dq 帧下的电压是随角度变化的？这在物理上是不对的，除非 frame 定义不同。
    // 通常 VF 开环：在旋转 frame (dq) 中，Vd=0, Vq=Constant。然后 Inverse Park(angle) -> AlphaBeta -> SVPWM。
    // 参考方案可能混淆了坐标系，或者它的 openloop_angle 用法不同。
    // 鉴于这是一个 FOC 文件，标准做法是：
    
    // 1. 计算目标电压幅值 (含 V/F 比和 Boost)
    float base_frequency = 50.0f; 
    float base_voltage = VOLTAGE_LIMIT * 0.8f;
    float vf_ratio = base_voltage / base_frequency;
    float min_voltage = controller->phase_resistance * CURRENT_LIMIT * 0.2f;
    float target_voltage = Fast_Fmax(min_voltage, vf_ratio * frequency);
    target_voltage = Fast_Fmin(target_voltage, voltage_amplitude);

    // 2. 在旋转坐标系下设置电压 (Id=0, Iq->Vq)
    controller->dq_voltage.d = 0.0f;
    controller->dq_voltage.q = target_voltage;
    
    // 3. 限制电压幅值
    float voltage_mag = Fast_Sqrt(controller->dq_voltage.d * controller->dq_voltage.d + 
                                  controller->dq_voltage.q * controller->dq_voltage.q);
    if (voltage_mag > VOLTAGE_LIMIT) {
        controller->dq_voltage.d *= (VOLTAGE_LIMIT / voltage_mag);
        controller->dq_voltage.q *= (VOLTAGE_LIMIT / voltage_mag);
    }

    // 4. 逆Park变换
    AlphaBeta_t voltage_ab = Inverse_Park_Transform(controller->dq_voltage, controller->electrical_angle);
    
    // 5. SVPWM调制
    SVPWM_Modulation(controller, voltage_ab.alpha, voltage_ab.beta);
}

/* ==================== FOC主循环 ==================== */

/**
 * @brief FOC主循环
 * @details 根据当前控制模式执行相应的控制算法
 */
void FOC_Loop(FOC_Controller_t* controller, float dt) {
    if (!controller->enabled || dt <= 0.0f) {
        return;
    }
    
    switch (controller->control_mode) {
        case FOC_MODE_CURRENT:
            // 电流环控制
            Current_Loop_FOC(controller, controller->target_current_q, dt);
            break;
            
        case FOC_MODE_VELOCITY:
            // 速度环控制 (外环) + 电流环控制 (内环)
            {
                float iq_ref = Velocity_Loop_Control(controller, controller->target_velocity, dt);
                Current_Loop_FOC(controller, iq_ref, dt);
            }
            break;
            
        case FOC_MODE_IF:
            // IF模式控制
            IF_Mode_Control(controller, controller->if_current_amplitude, 
                          controller->target_frequency, dt);
            break;
            
        case FOC_MODE_VF:
            // VF模式控制
            VF_Mode_Control(controller, controller->vf_voltage_amplitude, 
                          controller->target_frequency, dt);
            break;
            
        default:
            break;
    }
}

/* ==================== 控制器初始化和配置 ==================== */

/**
 * @brief 初始化FOC控制器
 */
int FOC_Init(FOC_Controller_t* controller, uint8_t motor_id) {
    if (motor_id != MOTOR_ID) {
        return -1;  // 仅支持motor_id=0
    }
    
    // 清零结构体
    memset(controller, 0, sizeof(FOC_Controller_t));
    
    // 设置电机参数
    controller->motor_id = motor_id;
    controller->pole_pairs = POLE_PAIRS;
    controller->phase_resistance = PHASE_RESISTANCE;
    controller->phase_inductance = PHASE_INDUCTANCE;
    controller->kv_rating = KV_RATING;
    
    // 初始化状态变量
    controller->shaft_angle = 0.0f;
    controller->shaft_velocity = 0.0f;
    controller->electrical_angle = 0.0f;
    controller->openloop_angle = 0.0f;
    controller->openloop_velocity = 0.0f;
    
    // 初始化目标变量
    controller->target_current_q = 0.0f;
    controller->target_current_d = 0.0f;
    controller->target_velocity = 0.0f;
    controller->target_voltage = 0.0f;
    controller->target_frequency = 0.0f;
    controller->if_current_amplitude = 1.0f;
    controller->vf_voltage_amplitude = 6.0f;
    
    // 初始化PI控制器 (使用典型的初始参数)
    PI_Init(&controller->pi_current_q, 3.0f, 300.0f, VOLTAGE_LIMIT);  // q轴电流PI
    PI_Init(&controller->pi_current_d, 3.0f, 300.0f, VOLTAGE_LIMIT);  // d轴电流PI
    PI_Init(&controller->pi_velocity, 0.5f, 10.0f, CURRENT_LIMIT);     // 速度PI
    
    // 初始化低通滤波器
    LPF_Init(&controller->lpf_current_q, 0.001f);  // 1ms时间常数
    LPF_Init(&controller->lpf_current_d, 0.001f);
    LPF_Init(&controller->lpf_velocity, 0.005f);   // 5ms时间常数
    
    // 初始化PWM输出
    controller->pwm_a = 0.5f;
    controller->pwm_b = 0.5f;
    controller->pwm_c = 0.5f;
    
    // 设置默认控制模式
    controller->control_mode = FOC_MODE_CURRENT;
    
    // 禁用控制器
    controller->enabled = false;
    
    // 存储控制器实例
    foc_controllers[motor_id] = *controller;
    
    return 0;
}

/**
 * @brief 配置PI控制器参数
 * @param pi PI控制器指针
 * @param kp 比例系数
 * @param ki 积分系数
 * @param limit 输出限制
 */
void PI_Init(PI_Controller_t* pi, float kp, float ki, float limit) {
    pi->kp = kp;
    pi->ki = ki;
    pi->integral = 0.0f;
    pi->prev_error = 0.0f;
    pi->output_limit = limit;
    pi->ramp_rate = 0.0f;  // 默认无斜坡限制
    pi->prev_output = 0.0f;
}

/**
 * @brief PI控制器计算
 * @param pi PI控制器指针
 * @param error 误差值
 * @param dt 时间间隔 [s]
 * @return PI输出值
 */
float PI_Compute(PI_Controller_t* pi, float error, float dt) {
    if (dt <= 0.0f || pi == NULL) return 0.0f;
    
    // 比例项
    float p_term = pi->kp * error;
    
    // 积分项
    pi->integral += error * dt * pi->ki;
    
    // 积分限幅，防止积分饱和
    if (pi->integral > pi->output_limit) {
        pi->integral = pi->output_limit;
    } else if (pi->integral < -pi->output_limit) {
        pi->integral = -pi->output_limit;
    }
    
    // 计算输出
    float output = p_term + pi->integral;
    
    // 输出限幅
    if (output > pi->output_limit) {
        output = pi->output_limit;
    } else if (output < -pi->output_limit) {
        output = -pi->output_limit;
    }
    
    // 斜坡限制
    if (pi->ramp_rate > 0.0f) {
        float max_delta = pi->ramp_rate * dt;
        float delta = output - pi->prev_output;
        
        if (delta > max_delta) {
            output = pi->prev_output + max_delta;
        } else if (delta < -max_delta) {
            output = pi->prev_output - max_delta;
        }
        
        pi->prev_output = output;
    }
    
    return output;
}

/**
 * @brief 重置PI控制器
 * @param pi PI控制器指针
 */
void PI_Reset(PI_Controller_t* pi) {
    pi->integral = 0.0f;
    pi->prev_error = 0.0f;
    pi->prev_output = 0.0f;
}

/**
 * @brief 设置控制模式
 */
void FOC_SetControlMode(FOC_Controller_t* controller, FOC_ControlMode_t mode) {
    // 切换模式时重置PI
    if (mode != controller->control_mode) {
        PI_Reset(&controller->pi_current_q);
        PI_Reset(&controller->pi_current_d);
        PI_Reset(&controller->pi_velocity);
        controller->openloop_angle = 0.0f;
    }
    
    controller->control_mode = mode;
}

/**
 * @brief 使能/禁用FOC控制器
 */
void FOC_Enable(FOC_Controller_t* controller, bool enable) {
    if (!controller) return;
    
    controller->enabled = enable;
    
    if (!enable) {
        // 禁用时重置所有控制器
        PI_Reset(&controller->pi_current_q);
        PI_Reset(&controller->pi_current_d);
        PI_Reset(&controller->pi_velocity);
        
        // 重置滤波器状态 (可选，防止突变)
        // controller->lpf_current_q.prev_output = 0.0f; ... 
        
        // 将PWM输出设为中点
        controller->pwm_a = 0.5f;
        controller->pwm_b = 0.5f;
        controller->pwm_c = 0.5f;
    } else {
        // 使能时重置角度和状态
        controller->openloop_angle = 0.0f;
        controller->electrical_angle = 0.0f;
        PI_Reset(&controller->pi_current_q);
        PI_Reset(&controller->pi_current_d);
        PI_Reset(&controller->pi_velocity);
    }
}

/* ==================== 获取控制器实例 ==================== */

/**
 * @brief 获取指定电机ID的控制器实例
 * @return 控制器指针，如果ID无效则返回NULL
 */
FOC_Controller_t* FOC_GetController(uint8_t motor_id) {
    if (motor_id == MOTOR_ID) {
        return &foc_controllers[motor_id];
    }
    return NULL;
}

/**
 * @brief ADC中断服务程序
 * @details 在ADC转换完成后触发，执行电机控制算法
 */
void ADC_IRQHandler(void) {
    // 检查是否是ADC中断
    if (__HAL_ADC_GET_FLAG(&hadc1, ADC_FLAG_EOC) && __HAL_ADC_GET_IT_SOURCE(&hadc1, ADC_IT_EOC)) {
        // 清除ADC中断标志
        __HAL_ADC_CLEAR_FLAG(&hadc1, ADC_FLAG_EOC);
        
        // 静态变量用于计算时间差
        static uint32_t last_tick = 0;
        uint32_t current_tick = HAL_GetTick();
        
        // 计算时间差（单位：秒）
        float dt;
        if(last_tick != 0) {
            dt = (float)(current_tick - last_tick) / 1000.0f;  // 转换为秒
        } else {
            dt = 0.001f;  // 初始时间差设为1ms
        }
        last_tick = current_tick;
        
        // 获取控制器实例
        FOC_Controller_t* controller = FOC_GetController(MOTOR_ID);
        if(controller != NULL) {
            // 执行FOC控制算法
            FOC_Loop(controller, dt);
        }
    }
}

/**
 * @brief 初始化ADC和定时器8，配置为由定时器8更新事件触发ADC采样
 */
void FOC_PWM_ADC_Timer_Init(void) {
    // 这里是示意代码，实际需要根据STM32 HAL库函数进行配置
    
