Cris7kaka/test1/STM32F4_FOC_Control.c
    /*
    // 1. 配置ADC1, ADC2, ADC3
    ADC_HandleTypeDef hadc1, hadc2, hadc3;
    
    // ADC1配置
    hadc1.Instance = ADC1;
    hadc1.Init.ClockPrescaler = ADC_CLOCK_SYNC_PCLK_DIV4;
    hadc1.Init.Resolution = ADC_RESOLUTION_12B;
    hadc1.Init.ScanConvMode = DISABLE;
    hadc1.Init.ContinuousConvMode = DISABLE;
    hadc1.Init.DiscontinuousConvMode = DISABLE;
    hadc1.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
    hadc1.Init.ExternalTrigConv = ADC_EXTERNALTRIGCONV_T8_TRGO;  // 由TIM8 TRGO触发
    hadc1.Init.DataAlign = ADC_DATAALIGN_RIGHT;
    hadc1.Init.NbrOfConversion = 1;
    hadc1.Init.DMAContinuousRequests = DISABLE;
    hadc1.Init.EOCSelection = ADC_EOC_SINGLE_CONV;
    
    if (HAL_ADC_Init(&hadc1) != HAL_OK) {
        Error_Handler();
    }
    
    // ADC2配置 (类似)
    hadc2.Instance = ADC2;
    // ... 类似的初始化代码 ...
    
    // ADC3配置 (类似)
    hadc3.Instance = ADC3;
    // ... 类似的初始化代码 ...
    
    // 2. 配置定时器8以产生PWM并触发ADC
    TIM_HandleTypeDef htim8;
    
    htim8.Instance = TIM8;
    htim8.Init.Prescaler = 0;
    htim8.Init.CounterMode = TIM_COUNTERMODE_CENTERALIGNED1;  // 中心对齐模式，可实现互补PWM
    htim8.Init.Period = 2100 - 1;  // 假设系统时钟为168MHz，预分频器为0，则PWM频率约为40kHz
    htim8.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim8.Init.RepetitionCounter = 0;
    
    if (HAL_TIM_PWM_Init(&htim8) != HAL_OK) {
        Error_Handler();
    }
    
    // 配置PWM通道
    TIM_OC_InitTypeDef sConfigOC;
    sConfigOC.OCMode = TIM_OCMODE_PWM1;
    sConfigOC.Pulse = 1050;  // 50%占空比
    sConfigOC.OCPolarity = TIM_OCPOLARITY_HIGH;
    sConfigOC.OCNPolarity = TIM_OCNPOLARITY_HIGH;
    sConfigOC.OCFastMode = TIM_OCFAST_DISABLE;
    sConfigOC.OCIdleState = TIM_OCIDLESTATE_RESET;
    sConfigOC.OCNIdleState = TIM_OCNIDLESTATE_RESET;
    
    // 配置三个通道用于三相PWM
    if (HAL_TIM_PWM_ConfigChannel(&htim8, &sConfigOC, TIM_CHANNEL_1) != HAL_OK ||
        HAL_TIM_PWM_ConfigChannel(&htim8, &sConfigOC, TIM_CHANNEL_2) != HAL_OK ||
        HAL_TIM_PWM_ConfigChannel(&htim8, &sConfigOC, TIM_CHANNEL_3) != HAL_OK) {
        Error_Handler();
    }
    
    // 配置定时器8的TRGO输出，用于触发ADC
    TIM_MasterConfigTypeDef sMasterConfig;
    sMasterConfig.MasterOutputTrigger = TIM_TRGO_UPDATE;  // 更新事件触发ADC
    sMasterConfig.MasterSlaveMode = TIM_MASTERSLAVEMODE_DISABLE;
    
    if (HAL_TIMEx_MasterConfigSynchronization(&htim8, &sMasterConfig) != HAL_OK) {
        Error_Handler();
    }
    
    // 3. 配置NVIC
    HAL_NVIC_SetPriority(ADC_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(ADC_IRQn);
    
    // 4. 启动ADC
    HAL_ADC_Start(&hadc1);
    HAL_ADC_Start(&hadc2);
    HAL_ADC_Start(&hadc3);
    
    // 5. 启动PWM输出
    HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_1);
    HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_2);
    HAL_TIM_PWM_Start(&htim8, TIM_CHANNEL_3);
    */
}

/**
 * @brief 定时器中断服务程序
 * @details 在中断中调用FOC控制算法，实现基于中断的电机控制
 */
void TIMx_CC_IRQHandler(void) {  // 这里TIMx需要根据实际使用的定时器修改
    // 清除中断标志位（根据实际定时器型号修改）
    // __HAL_TIM_CLEAR_IT(&htimx, TIM_IT_CCx);
    
    // 静态变量用于计算时间差
    static uint32_t last_tick = 0;
    uint32_t current_tick = HAL_GetTick();
    
    // 计算时间差（单位：秒）
    float dt;
    if(last_tick != 0) {
        dt = (float)(current_tick - last_tick) / 1000.0f;  // 转换为秒
    } else {
        dt = 0.001f;  // 初始时间差设为1ms
    }
    last_tick = current_tick;
    
    // 获取控制器实例
    FOC_Controller_t* controller = FOC_GetController(MOTOR_ID);
    if(controller != NULL) {
        // 执行FOC控制算法
        FOC_Loop(controller, dt);
    }
}

/**
 * @brief 初始化控制定时器
 * @details 配置定时器以指定频率触发中断，执行电机控制算法
 */
void FOC_Timer_Init(uint32_t pwm_frequency_hz) {
    // 计算ARR值（自动重装载值）
    // 假设定时器时钟频率为APB总线频率，可以根据实际情况调整
    uint32_t timer_clock = 84000000; // 例如：STM32F4 APB1 = 84MHz, APB2 = 168MHz
    
    // 根据PWM频率计算定时器重装载值
    uint32_t arr_value = timer_clock / pwm_frequency_hz;
    
    // 这里是示意代码，实际需要根据使用的定时器进行配置
    /*
    htimx.Instance = TIMx; // 根据实际使用的定时器修改
    htimx.Init.Prescaler = 0;
    htimx.Init.CounterMode = TIM_COUNTERMODE_UP;
    htimx.Init.Period = arr_value - 1;
    htimx.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htimx.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_ENABLE;
    
    if (HAL_TIM_Base_Init(&htimx) != HAL_OK) {
        // 初始化错误处理
        Error_Handler();
    }
    
    // 配置定时器更新中断
    HAL_NVIC_SetPriority(TIMx_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(TIMx_IRQn);
    
    // 启动定时器并开启中断
    HAL_TIM_Base_Start_IT(&htimx);
    */
}
